# CopingWarningIgnored Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..CopingWarningIgnored Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Cuts on concrete members are ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CopingWarningIgnored { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CopingWarningIgnored As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CopingWarningIgnored {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace